```sql
-- Drops the books_db if it already exists --
DROP DATABASE IF EXISTS books_db;
CREATE DATABASE books_db;
USE books_db;

CREATE TABLE books(
  id INTEGER(11) AUTO_INCREMENT NOT NULL,
  authorId INTEGER(11),
  title VARCHAR(100),
  PRIMARY KEY (id)
);

CREATE TABLE authors(
  id INTEGER(11) AUTO_INCREMENT NOT NULL,
  firstName VARCHAR(100),
  lastName VARCHAR(100),
  PRIMARY KEY (id)
);

INSERT INTO authors (firstName, lastName) values ('Jane', 'Austen');
INSERT INTO authors (firstName, lastName) values ('Mark', 'Twain');
INSERT INTO authors (firstName, lastName) values ('Lewis', 'Carroll');
INSERT INTO authors (firstName, lastName) values ('Andre', 'Asselin');

INSERT INTO books (title, authorId) values ('Pride and Prejudice', 1);
INSERT INTO books (title, authorId) values ('Emma', 1);
INSERT INTO books (title, authorId) values ('The Adventures of Tom Sawyer', 2);
INSERT INTO books (title, authorId) values ('Adventures of Huckleberry Finn', 2);
INSERT INTO books (title, authorId) values ('Alice''s Adventures in Wonderland', 3);
INSERT INTO books (title, authorId) values ('Dracula', null);

```

In [2]:
from sqlalchemy import create_engine
import pandas as pd
from warnings import filterwarnings
import pymysql
filterwarnings('ignore', category=pymysql.Warning)
import os

In [7]:
engine = create_engine('mysql+pymysql://root:kcmo1728@localhost/books_db')
books = pd.read_sql_query('select * from books', engine)
books

   id  authorId                             title
0   1       1.0               Pride and Prejudice
1   2       1.0                              Emma
2   3       2.0      The Adventures of Tom Sawyer
3   4       2.0    Adventures of Huckleberry Finn
4   5       3.0  Alice's Adventures in Wonderland
5   6       NaN                           Dracula

In [8]:
engine = create_engine('mysql+pymysql://root:kcmo1728@localhost/books_db')
author = pd.read_sql_query('select * from authors', engine)
author

   id firstName lastName
0   1      Jane   Austen
1   2      Mark    Twain
2   3     Lewis  Carroll
3   4     Andre  Asselin